In [1]:
%config Completer.use_jedi = False

### Imports

In [2]:
import numpy as np
import re

### 1. How to import pandas and check the version?

##### solution:

In [3]:
import pandas as pd
pd.__version__

'1.1.1'

### 2. How to create a series from a list, numpy array and dict?

##### Input:

In [4]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

##### solution:

In [5]:
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
ser3.head(10)

a    0
b    1
c    2
e    3
d    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

### 3. How to convert the index of a series into a column of a dataframe?

##### Input:

In [6]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

##### solution:

In [7]:
ser.to_frame().reset_index()

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

### 4. How to combine many series to form a dataframe?

##### Input:

In [8]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

##### solution:

In [9]:
pd.DataFrame({'ser1': ser1, 'ser2': ser2})
# or
pd.concat([ser1, ser2], axis=1)

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

### 5. How to assign name to the series’ index?

##### Input:

In [10]:
# Give a name to the series ser calling it ‘alphabets’.

ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

##### solution:

In [11]:
ser.name = 'alphabets'
ser.head(10)

0    a
1    b
2    c
3    e
4    d
5    f
6    g
7    h
8    i
9    j
Name: alphabets, dtype: object

### 6. How to get the items of series A not present in series B?

##### Input:

In [12]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

##### solution:

In [13]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

### 7. How to get the items not common to both series A and series B?

##### Input:

In [14]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

##### solution:

In [15]:
s1_dis = ser1[~ser1.isin(ser2)].reset_index(drop=True)
s2_dis = ser2[~ser2.isin(ser1)].reset_index(drop=True) 
pd.concat([s1_dis, s2_dis]).reset_index(drop=True)

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

### 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

##### Input:

In [16]:
ser = pd.Series(np.random.normal(10, 5, 25))

##### solution:

In [17]:
np.percentile(ser, [0, 25, 50, 75, 100])

array([ 3.72581504,  6.84530375,  8.97609124, 13.11124437, 18.41978494])

### 9. How to get frequency counts of unique items of a series?

##### Input:

In [18]:
ser = pd.Series(
        np.take(
            list('abcdefgh'), 
            np.random.randint(8, size=30))
    )

##### solution:

In [19]:
ser.value_counts(sort=True)

h    7
a    6
f    5
b    5
c    2
d    2
e    2
g    1
dtype: int64

### 10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

##### Input:

In [20]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

##### solution:

In [21]:
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

0     Other
1         1
2         1
3         4
4         4
5     Other
6         4
7         1
8         1
9         4
10        4
11        4
dtype: object

### 11. How to bin a numeric series to 10 groups of equal size?

##### Input:

In [22]:
ser = pd.Series(np.random.random(20))

##### solution:

In [23]:
pd.qcut(ser, 10, labels=['1st','2nd','3rd','4th','5th','6th','7th','8th','9th','10th'])

0      9th
1      4th
2      6th
3      8th
4      9th
5     10th
6      2nd
7     10th
8      8th
9      1st
10     7th
11     3rd
12     5th
13     3rd
14     5th
15     4th
16     2nd
17     7th
18     1st
19     6th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

### 12. How to convert a numpy array to a dataframe of given shape? (L1)

##### Input:

In [24]:
# Reshape the series ser into a dataframe with 7 rows and 5 columns
ser = pd.Series(np.random.randint(1, 10, 35))

##### solution:

In [25]:
arr = np.reshape(ser.values, (-1, 5))
arr, arr.shape

(array([[9, 6, 6, 5, 1],
        [7, 5, 1, 8, 9],
        [1, 9, 5, 2, 6],
        [3, 9, 5, 1, 9],
        [3, 5, 4, 3, 1],
        [1, 5, 5, 6, 9],
        [7, 4, 1, 7, 2]]),
 (7, 5))

### 13. How to find the positions of numbers that are multiples of 3 from a series?

##### Input:

In [26]:
ser = pd.Series(np.random.randint(1, 10, 7))

##### solution:

In [27]:
check_multiple = lambda x: x if x%3 == 0 else None 
print(ser.apply(check_multiple).dropna().index.values)
# or 
np.argwhere(ser.values % 3 == 0)

[0 2 3]

array([[0],
       [2],
       [3]])

### 14. How to extract items at given positions from a series

##### Input:

In [28]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

##### solution:

In [29]:
ser.values[pos]

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

### 15. How to stack two series vertically and horizontally ?

##### Input:

In [30]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

##### solution:

In [31]:
print("vertical:\n\n",ser1.append(ser2))
print('horizonatal:\n\n', pd.concat([ser1, ser2], axis=1))

vertical:

 0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object
horizonatal:

    0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

### 16. How to get the positions of items of series A in another series B?

##### Input:

In [32]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

##### solution:

In [33]:
print(ser2.apply(lambda x: np.where(x == ser1)[0].tolist()))
# or
[pd.Index(ser1).get_loc(i) for i in ser2]

0    [5]
1    [4]
2    [0]
3    [8]
dtype: object

[5, 4, 0, 8]

### 17. How to compute the mean squared error on a truth and predicted series?

##### Input:

In [34]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

##### solution:

MSE  = 1/n(sum(pred(i) - truth(i))) for every i in array

In [35]:
print(sum([(p-a)**2 for a, p in zip(truth, pred)])/len(truth))
# or
mse = (np.square(pred - truth)).mean()
mse

0.4278757957905654

0.4278757957905654

### 18. How to convert the first character of each element in a series to uppercase?

##### Input:

In [36]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

##### solution:

In [37]:
ser.apply(lambda x: x.title())

0     How
1      To
2    Kick
3    Ass?
dtype: object

### 19. How to calculate the number of characters in each word in a series?

##### Input:

In [38]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

##### solution:

In [39]:
ser.apply(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

### 20. How to compute difference of differences between consequtive numbers of a series?

##### Input:

In [40]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

##### solution:

In [41]:
ser.diff().diff()

0    NaN
1    NaN
2    1.0
3    1.0
4    1.0
5    1.0
6    0.0
7    2.0
dtype: float64

### 21. How to convert a series of date-strings to a timeseries?

##### Input:

In [42]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

##### solution:

In [43]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?

##### Input:

In [44]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

##### solution:

In [45]:
dt_ser = pd.to_datetime(ser)
print(dt_ser, "\n")
print("day of month:", dt_ser.dt.day.tolist())
print("week number: ", dt_ser.dt.isocalendar().week.tolist())
print("day of year: ", dt_ser.dt.dayofyear.tolist())
print("day of week: ", dt_ser.dt.day_name().tolist())

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

day of month: [1, 2, 3, 4, 5, 6]
week number:  [53, 5, 9, 14, 19, 23]
day of year:  [1, 33, 63, 94, 125, 157]
day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

### 23. How to convert year-month string to dates corresponding to the 4th day of the month?

##### Input:

In [46]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

##### solution:

In [47]:
pd.to_datetime("04 " + ser)

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

### 24. How to filter words that contain atleast 2 vowels from a series?

##### Input:

In [48]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

##### solution:

In [49]:
def count_vow(w):
    if sum([1 if i in 'aeiou' else 0 for i in w.lower()]) > 1:
        return w    
ser.map(count_vow).dropna()

0     Apple
1    Orange
4     Money
dtype: object

### 25. How to filter valid emails from a series?

##### Input:

In [50]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

##### solution:

In [51]:
mask = emails.apply(lambda x: bool(re.search(pattern, x)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

### 26. How to get the mean of a series grouped by another series?

##### Input:

In [52]:
fruits = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruits.tolist())

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['carrot', 'carrot', 'apple', 'apple', 'banana', 'carrot', 'apple', 'apple', 'carrot', 'banana']

##### solution:

In [53]:
weights.groupby(fruits).mean()

apple     5.5
banana    7.5
carrot    4.5
dtype: float64

### 27. How to compute the euclidean distance between two series?

##### Input:

In [54]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

##### solution:

In [55]:
np.linalg.norm(p-q)

18.16590212458495

### 28. How to find all the local maxima (or peaks) in a numeric series?

##### Input:

In [56]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

##### solution:

In [57]:
(np.diff(np.sign(np.diff(ser))) < 0).nonzero()[0] + 1

array([1, 5, 7])

### 29. How to replace missing spaces in a string with the least frequent character?

##### Input:

In [58]:
my_str = 'dbc deb abed gade'

##### solution:

In [59]:
least_freq = pd.Series(list(my_str)).value_counts().dropna().index[-1]
my_str.replace(" ", least_freq)

'dbcgdebgabedggade'

### 30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

##### solution:

In [60]:
ts = pd.date_range('2000-01-01', periods=10, freq=pd.offsets.Week())
rn = np.random.randint(1, 52, 10)
ser = pd.concat([pd.Series(ts), pd.Series(rn)], axis=1)
ser

           0   1
0 2000-01-01  16
1 2000-01-08  30
2 2000-01-15  10
3 2000-01-22  42
4 2000-01-29   6
5 2000-02-05  42
6 2000-02-12  22
7 2000-02-19  27
8 2000-02-26  12
9 2000-03-04  42

### 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

##### Input:

In [61]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

##### solution:

In [62]:
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

### 32. How to compute the autocorrelations of a numeric series?

##### Input:

In [63]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

##### solution:

In [64]:
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[0.27, 0.41, -0.01, 0.42, 0.44, 0.24, 0.07, 0.13, 0.33, 0.1]
Lag having highest correlation:  5

### 33. How to import only every nth row from a csv file to create a dataframe?

##### Input:

In [65]:
# Import every 50th row of BostonHousing dataset as a dataframe.
fr = pd.read_csv("https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv", chunksize=50)

##### solution:

In [66]:
df = pd.DataFrame([chunk.iloc[0,:] for chunk in fr])
df

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

### 34. How to change column values when importing csv to a dataframe?

##### Input:

Import the boston housing dataset, but while importing change the 'medv' 
(median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

##### solution:

In [67]:
csv_file = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"

df = (pd
    .read_csv(csv_file, 
             converters={'medv': lambda x: "Low" if float(x)<25 else ("High" if float(x)>25 else x)})
     )
df

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,Low
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,Low
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,Low
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,Low
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,Low

### 35. How to create a dataframe with rows as strides from a given series?

##### Input:

In [68]:
L = pd.Series(range(15))

##### solution:

In [69]:
def gen_strides(a, stride_len=5, window_len=5):
    n_strides = ((a.size-window_len)//stride_len) + 1
    return np.array([a[s:(s+window_len)] for s in np.arange(0, a.size, stride_len)[:n_strides]])

gen_strides(L, stride_len=2, window_len=4)

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

### 36. How to import only specified columns from a csv file?

##### Input:

Import ‘crim’ and ‘medv’ columns of the BostonHousing dataset as a dataframe.

##### solution:

In [70]:
csv = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"

In [71]:
df = pd.read_csv(csv, usecols=["crim", "medv"])
df

        crim  medv
0    0.00632  24.0
1    0.02731  21.6
2    0.02729  34.7
3    0.03237  33.4
4    0.06905  36.2
..       ...   ...
501  0.06263  22.4
502  0.04527  20.6
503  0.06076  23.9
504  0.10959  22.0
505  0.04741  11.9

[506 rows x 2 columns]

### 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

##### Input:

In [72]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'

##### solution:

In [73]:
df = pd.read_csv(csv)
print("nrows, ncolumns:", df.shape)
print("\ncolumns datatypes:", df.dtypes)
print("\nSummary: ",df.describe())
print("\narray:", np.asarray(df))
print("\nlist:", list(df))

nrows, ncolumns: (93, 27)

columns datatypes: Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object

Summary:         Min.Price      Price  Max.Price   MPG.city  MPG.highway  EngineSize  \
count  86.000000  91.000000  88.000000  84.000000    91.000000   91.000000
mean   17.118605  19.616484  21.459091  22.404762    29.065934    2.658242
std     8.828290   9.724280  10.696563   5.841520     5.370293    1.045845
min     6.700000   7.400000   7.900000  15.000000    20.000000    1.000000
25%    10.825000  12.350000  14.575000  18.000000    26.000000    1.800000
50%    14.600000  17.700000  19.150000  21.000000    28.000000    2.300000
75%    20.250000  23.500000  24.825000  25.000000    31.000000    3.250000
max    45.400000  61.900000  80.000000  46.000000    50.000000    5.700000

       Horsepower          RPM  Rev.per.mile  Fuel.tank.capacity  Passengers  \
count   86.000000    90.000000     87.000000           85.000000   91.000000
mean   144.000000  5276.666667   2355.000000           16.683529    5.076923
std     53.455204   605.554811    486.916616            3.375748    1.045953
min     55.000000  3800.000000   1320.000000            9.200000    2.000000
25%    100.750000  4800.000000   2017.500000           14.500000    4.000000
50%    140.000000  5200.000000   2360.000000           16.500000    5.000000
75%    170.000000  5787.500000   2565.000000           19.000000    6.000000
max    300.000000  6500.000000   3755.000000           27.000000    8.000000

           Length   Wheelbase      Width  Turn.circle  Rear.seat.room  \
count   89.000000   92.000000  87.000000    88.000000       89.000000
mean   182.865169  103.956522  69.448276    38.954545       27.853933
std     14.792651    6.856317   3.778023     3.304157        3.018129
min    141.000000   90.000000  60.000000    32.000000       19.000000
25%    174.000000   98.000000  67.000000    36.000000       26.000000
50%    181.000000  103.000000  69.000000    39.000000       27.500000
75%    192.000000  110.000000  72.000000    42.000000       30.000000
max    219.000000  119.000000  78.000000    45.000000       36.000000

       Luggage.room       Weight
count     74.000000    86.000000
mean      13.986486  3104.593023
std        3.120824   600.129993
min        6.000000  1695.000000
25%       12.000000  2647.500000
50%       14.000000  3085.000000
75%       16.000000  3567.500000
max       22.000000  4105.000000

array: [['Acura' 'Integra' 'Small' ... 2705.0 'non-USA' 'Acura Integra']
 [nan 'Legend' 'Midsize' ... 3560.0 'non-USA' 'Acura Legend']
 ['Audi' '90' 'Compact' ... 3375.0 'non-USA' 'Audi 90']
 ...
 ['Volkswagen' 'Corrado' 'Sporty' ... 2810.0 'non-USA'
  'Volkswagen Corrado']
 ['Volvo' '240' 'Compact' ... 2985.0 'non-USA' 'Volvo 240']
 [nan '850' 'Midsize' ... 3245.0 'non-USA' 'Volvo 850']]

list: ['Manufacturer', 'Model', 'Type', 'Min.Price', 'Price', 'Max.Price', 'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders', 'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail', 'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width', 'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin', 'Make']

### 38. How to extract the row and column number of a particular cell with given criterion?

##### Input:

Which manufacturer, model and type has the highest Price? What is the row and column number of the cell with the highest Price value?

##### solution:

In [74]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(csv)
df[df["Price"] == max(df["Price"])][["Manufacturer", "Model", "Type", "Price"]]

     Manufacturer Model     Type  Price
58  Mercedes-Benz  300E  Midsize   61.9

### 39. How to rename a specific columns in a dataframe?

##### Input:

Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.

##### solution:

In [75]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = (pd.
      read_csv(csv).
      rename(columns = {"Type":"CarType"})
     )
df.columns = df.columns.map(lambda x: x.replace(".", "_"))
df.head()

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

### 40. How to check if a dataframe has any missing values?

##### Input:

In [76]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'

##### solution:

In [77]:
pd.read_csv(csv).isna().values.any()

True

### 41. How to count the number of missing values in each column?

##### Input:

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

##### solution:

In [78]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
na_col_count = pd.read_csv(csv).isnull().sum()
na_col_count, na_col_count.idxmax()

(Manufacturer           4
 Model                  1
 Type                   3
 Min.Price              7
 Price                  2
 Max.Price              5
 MPG.city               9
 MPG.highway            2
 AirBags                6
 DriveTrain             7
 Cylinders              5
 EngineSize             2
 Horsepower             7
 RPM                    3
 Rev.per.mile           6
 Man.trans.avail        5
 Fuel.tank.capacity     8
 Passengers             2
 Length                 4
 Wheelbase              1
 Width                  6
 Turn.circle            5
 Rear.seat.room         4
 Luggage.room          19
 Weight                 7
 Origin                 5
 Make                   3
 dtype: int64,
 'Luggage.room')

### 42. How to replace missing values of multiple numeric columns with the mean?

##### Input:

Replace missing values in Min.Price and Max.Price columns with their respective mean.

##### solution:

In [79]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
cols = ["Min.Price", "Max.Price"]
df = pd.read_csv(csv)
df[cols] = df[cols].apply(lambda x: x.fillna(x.mean()), axis=0)
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.800000,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.700000,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.300000,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.600000,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,21.459091,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

### 43. How to use apply function on existing columns with global variables as additional arguments?

##### Input:

use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

##### solution:

In [80]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
cols = ["Min.Price", "Max.Price"]
df = pd.read_csv(csv)
d = {'Min.Price': np.nanmean, 'Max.Price': np.nanmedian}
df[cols] = df[cols].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.80,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.70,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.30,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.60,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,19.15,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

### 44. How to select a specific column from a dataframe as a dataframe instead of a series?

##### Input:

Get the first column (a) in df as a dataframe (rather than as a Series).

##### solution:

In [81]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[["a"]]

    a
0   0
1   5
2  10
3  15

### 45. How to change the order of columns of a dataframe?

##### Input:

1. In df, interchange columns 'a' and 'c'.
2. Create a generic function to interchange two columns, without hardcoding column names.
3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

##### solution:

In [82]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
cols = df.columns

# 1
print(df[list("cbade")])

# 2
def reorder_col(df, col1, col2):
    cols = list(df.columns)
    col1_inx, col2_idx = cols.index(col1), cols.index(col2)
    cols[col2_idx], cols[col1_inx] = col1, col2
    return df[cols]
print( reorder_col(df, "a", "d"))

# 3
df[sorted(cols, reverse=True)]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19
    d   b   c   a   e
0   3   1   2   0   4
1   8   6   7   5   9
2  13  11  12  10  14
3  18  16  17  15  19

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

### 46. How to set the number of rows and columns displayed in the output?

##### Input:

Change the pamdas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

##### solution:

In [83]:
pd.set_option("display.max_columns", 10)
pd.set_option("display.max_rows", 10)
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(csv)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

### 47. How to format or suppress scientific notations in a pandas dataframe?

##### Input:

Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.

##### solution:

In [84]:
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
pd.options.display.float_format = '{:.4f}'.format
df

   random
0  0.0138
1  0.6077
2  0.0005
3  0.5428

### 48. How to format all the values in a dataframe as percentages?

##### Input:

Format the values in column 'random' of df as percentages.

##### solution:

In [85]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df = df.style.format({
    'random': '{0:.2%}'.format,
})
df

### 49. How to filter every nth row in a dataframe?

##### Input:

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

##### solution:

In [86]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
pd.read_csv(csv).iloc[::20][["Manufacturer","Model","Type"]]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

### 50. How to create a primary key index by combining relevant columns?

##### Input:

Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

##### solution:

In [87]:
csv = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
cols = ['Manufacturer', 'Model', 'Type']
df = pd.read_csv(csv)
df[cols] = df[cols].apply(lambda x: x.fillna("missing"))
df.index = df[cols].apply(lambda row: '_'.join(row.values.astype(str)), axis=1)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
Acura_Integra_Small,Acura,Integra,Small,12.9000,15.9000,...,26.5000,nan,2705.0000,non-USA,Acura Integra
missing_Legend_Midsize,missing,Legend,Midsize,29.2000,33.9000,...,30.0000,15.0000,3560.0000,non-USA,Acura Legend
Audi_90_Compact,Audi,90,Compact,25.9000,29.1000,...,28.0000,14.0000,3375.0000,non-USA,Audi 90
Audi_100_Midsize,Audi,100,Midsize,nan,37.7000,...,31.0000,17.0000,3405.0000,non-USA,Audi 100
BMW_535i_Midsize,BMW,535i,Midsize,nan,30.0000,...,27.0000,13.0000,3640.0000,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
Volkswagen_Eurovan_Van,Volkswagen,Eurovan,Van,16.6000,19.7000,...,34.0000,nan,3960.0000,NaN,Volkswagen Eurovan
Volkswagen_Passat_Compact,Volkswagen,Passat,Compact,17.6000,20.0000,...,31.5000,14.0000,2985.0000,non-USA,Volkswagen Passat
Volkswagen_Corrado_Sporty,Volkswagen,Corrado,Sporty,22.9000,23.3000,...,26.0000,15.0000,2810.0000,non-USA,Volkswagen Corrado
Volvo_240_Compact,Volvo,240,Compact,21.8000,22.7000,...,29.5000,14.0000,2985.0000,non-USA,Volvo 240
missing_850_Midsize,missing,850,Midsize,24.8000,26.7000,...,30.0000,15.0000,3245.0000,non-USA,Volvo 850

### 51. How to get the row number of the nth largest value in a column?

##### Input:

Find the row position of the 5th largest value of column 'a' in df.

##### solution:

In [88]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
n = 5
df["a"].argsort()[::-1][n], df

(2,
     a   b   c
 0  11  12   2
 1  28  24   4
 2   9   3   3
 3  23  16   2
 4   3  29  22
 5   6  17  25
 6   3   1   6
 7  16   7  25
 8   1  16  27
 9   3  25  28)

### 52. How to find the position of the nth largest value greater than a given value?

##### Input:

find the position of the 2nd largest value greater than the mean.

##### solution:

In [95]:
ser = pd.Series(np.random.randint(1, 100, 15))
n = 2
print(ser.tolist(), "\nMean:", format(ser.mean(), '.2f'))
np.argsort(ser > ser.mean())[n]

[44, 63, 68, 69, 90, 37, 38, 30, 60, 10, 67, 81, 76, 38, 47]
Mean: 54.53

6


### 53. How to get the last n rows of a dataframe with row sum > 100?

##### Input:

Get the last two rows of df whose row sum is greater than 100.

##### solution:

In [123]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
nlast = 2
ngt = 100

(df[df
    .assign(rowsum = df.apply(sum, axis=1))
    .rowsum > ngt][-nlast:]
)

     0   1   2   3
11  37  26  38  15
14  32  38  23  11

### 54. How to find and cap outliers from a series or dataframe column?

##### Input:

Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

##### solution:

In [137]:
ser = pd.Series(np.logspace(-2, 2, 30))
min_out, max_out = 5, 95

min_per, max_per = np.percentile(ser, min_out), np.percentile(ser, max_out)
ser[ser < min_per], ser[ser > max_per] = min_per, max_per
ser

0     0.0160
1     0.0160
2     0.0189
3     0.0259
4     0.0356
       ...
25   28.0722
26   38.5662
27   52.9832
28   63.8767
29   63.8767
Length: 30, dtype: float64

### 55. How to reshape a dataframe to the largest possible square after removing the negative values?

##### Input:

Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.|

##### solution:

In [164]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
x = pd.Series(df[~df < 0].values.reshape(-1)).dropna()
s = int(np.floor(x.shape[0]**.5))
top_indexes = np.argsort(x)[::-1]
possible_square = np.take(x, sorted(top_indexes[:s**2])).values.reshape(s, -1)
df, possible_square

(    0   1   2   3   4   5   6   7   8   9
 0  35  -1  -1   5  -7  -3  25  49  11   9
 1  28  45   8 -17   2  -8 -12   3  27  -8
 2  17 -14  15  22  12 -10  30  49  28  26
 3 -14 -14  43  25  47  27 -17  40 -11  48
 4  39  -2   7  16  13  36  13  13  -6  37
 5  26 -16  10 -14   5  -2  23  -7  31  17
 6  34 -11 -11  48  18  36  36   4 -18  26
 7  42   5  21  22  -3  -4  -5  16  38   9
 8  -7  20  22   4  -3  36 -14  13  12  28
 9 -14  44  46 -10 -13  39  49   5  -2  13,
 array([[35.,  5., 25., 49., 11.,  9., 28., 45.],
        [ 8., 27., 17., 15., 22., 12., 30., 49.],
        [28., 26., 43., 25., 47., 27., 40., 48.],
        [39.,  7., 16., 13., 36., 13., 13., 37.],
        [26., 10.,  5., 23., 31., 17., 34., 48.],
        [18., 36., 36., 26., 42.,  5., 21., 22.],
        [16., 38.,  9., 20., 22.,  4., 36., 13.],
        [12., 28., 44., 46., 39., 49.,  5., 13.]]))

### 56. How to swap two rows of a dataframe?

##### Input:

Swap rows 1 and 2 in df.

##### solution:

In [189]:
def swap_rows(df, frow, srow):
    print("Previously: \n", df)
    temp = df.iloc[frow].copy()
    df.iloc[frow], df.iloc[srow] = df.iloc[srow], temp
    return df

In [193]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
swap_rows(df, 1, 2)

Previously:
     0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

### 57. How to reverse the rows of a dataframe?

##### Input:

Reverse all the rows of dataframe df.

##### solution:

In [201]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df.iloc[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

### 58. How to create one-hot encodings of a categorical variable (dummy variables)?

##### Input:

Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

##### solution:

In [212]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

con = (pd
       .concat(
           [pd
            .get_dummies(df['a'], prefix='a'), 
            df.iloc[:, 1:]
           ], 
            axis=1)
      )
con

   a_0  a_5  a_10  a_15  a_20   b   c   d   e
0    1    0     0     0     0   1   2   3   4
1    0    1     0     0     0   6   7   8   9
2    0    0     1     0     0  11  12  13  14
3    0    0     0     1     0  16  17  18  19
4    0    0     0     0     1  21  22  23  24

### 59. Which column contains the highest number of row-wise maximum values?

##### Input:

Obtain the column name with the highest number of row-wise maximum’s in df.

##### solution:

In [222]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))

max_col = (df
           .apply(np.argmax, axis=1)
           .value_counts()
           [0]
          )
"column with highest row wise maximum", max_col

('column with highest row wise maximum', 4)

### 60. How to create a new column that contains the row number of nearest column by euclidean distance?

##### Input:

Create a new column such that, each row contains the row number of nearest row-record by euclidean distance.

##### solution:

In [236]:
df = (pd
      .DataFrame(np.random.randint(1,100, 40)
                 .reshape(10, -1), 
             columns=list('pqrs'), 
             index=list('abcdefghij')
                )
     )
nearest_rows = []
nearest_distance = []

# iterate rows.
for i, row in df.iterrows():
    curr = row
    rest = df.drop(i)
    e_dists = {}  
    for j, contestant in rest.iterrows():
        e_dists[j] = round(np.linalg.norm(curr.values - contestant.values))
    nearest_rows.append(min(e_dists, key=e_dists.get))
    nearest_distance.append(min(e_dists.values()))

df['nearest_row'] = nearest_rows
df['dist'] = nearest_distance
df

    p   q   r   s nearest_row    dist
a  70  23  65  38           e 58.0000
b  79   1  24  93           f 52.0000
c  61  62  47  88           j 41.0000
d  80  91  87  27           e 70.0000
e  93  50  79  82           c 47.0000
f  31   3  10  80           h 28.0000
g  56  48   8  42           j 41.0000
h  30  24  27  86           i 27.0000
i   7  28  29  73           h 27.0000
j  61  66   7  79           c 41.0000

### 61. How to know the maximum possible correlation value of each column against other columns?

##### Input:

Compute maximum possible absolute correlation value of each column against other columns in df.

##### solution:

In [247]:
df = (pd
      .DataFrame(np.random.randint(1,100, 80).reshape(8, -1), 
                 columns=list('pqrstuvwxy'), 
                 index=list('abcdefgh'))
     )
np.round(np.abs(df.corr()).apply(lambda x: sorted(x)[-2]).tolist(), 2)

array([0.61, 0.59, 0.63, 0.55, 0.55, 0.55, 0.71, 0.42, 0.71, 0.46])

### 62. How to create a column containing the minimum by maximum of each row?

##### Input:

Compute the minimum-by-maximum for every row of df.

##### solution:

In [267]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

df.assign(min_by_max = df.apply(lambda x: format(min(x)/max(x), '.2f'), axis=1))

    0   1   2   3   4  ...   6   7   8   9  min_by_max
0  61  39  75   5  55  ...  53  89   7  52        0.03
1  13  41   7  98  97  ...  13   4  32  34        0.04
2  27  52  80  79  19  ...  34  41   3  82        0.04
3  27  32  18  55   8  ...  45  24  88  11        0.09
4  24  92  18  20  81  ...  20  31  34  13        0.14
5  59  88  73   2   2  ...  39  91  53  71        0.02
6  62  74  35  48  47  ...  62  61  62  62        0.44
7  85  42  44  19  73  ...  60  69  52  34        0.22

[8 rows x 11 columns]

### 63. How to create a column that contains the penultimate value in each row?

##### Input:

Create a new column 'penultimate' which has the second largest value of each row of df.

##### solution:

In [272]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
n = 2

df.assign(penultimate = df.apply(lambda x: sorted(x)[-n], axis=1))

    0   1   2   3   4  ...   6   7   8   9  penultimate
0  71  76  90  58  68  ...  16  80   7  14           80
1  11  57  75   6  19  ...  87  68  29  15           75
2  83  64   9  61  90  ...  11  29  53  44           83
3   7  19  76  49  82  ...  55   1  85  68           82
4  34  90  71  21   4  ...  91  51  70   5           90
5  95  82  96  32  35  ...  22  71  51  52           95
6  92  32  61  27  19  ...  70  35  74  59           74
7  99   5  24  83  57  ...  49   7  14   2           83

[8 rows x 11 columns]

### 64. How to normalize all columns in a dataframe?

##### Input:

1. Normalize all columns of df by subtracting the column mean and divide by standard deviation.
2. Range all columns of df such that the minimum value in each column is 0 and max is 1.

##### solution:

In [299]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

out1 = df.apply(lambda x: ((x - x.mean())/x.std()).round(2))
out2 = out1.apply(lambda x: ((x.max() - x)/(x.max() - x.min())).round(2))

In [301]:
out1

,0,1,2,3,4,5,6,7,8,9
0,0.5100,0.0500,0.9800,1.0600,-0.3700,0.1100,-0.6300,-1.2000,1.2900,0.0500
1,-1.2900,0.4500,-1.0900,1.7300,1.1500,1.7300,-0.7700,0.9900,1.0500,-1.2400
2,0.2900,-0.8200,1.4300,0.3000,0.3400,-1.0400,0.8200,-0.9900,0.8700,-0.0500
3,-1.4500,-0.3700,0.6300,-0.6100,0.4100,0.1100,-1.5200,1.2300,-1.3000,0.1200
4,1.0000,1.7400,-1.0900,-1.1500,0.8700,0.8800,1.0500,-0.1400,-0.5800,0.8900
5,0.2900,0.9600,-1.0500,-1.0200,0.3000,-1.4200,0.2700,0.2100,-0.2300,-1.5600
6,1.2200,-1.0300,-0.1300,-0.1700,-1.9600,-0.3600,-0.4800,0.9500,-1.1800,0.3300
7,-0.5800,-0.9700,0.3100,-0.1400,-0.7600,-0.0200,1.2800,-1.0600,0.0700,1.4500

In [302]:
out2

       0      1      2      3      4      5      6      7      8      9
0 0.2700 0.6100 0.1800 0.2300 0.4900 0.5100 0.6800 1.0000 0.0000 0.4700
1 0.9400 0.4700 1.0000 0.0000 0.0000 0.0000 0.7300 0.1000 0.0900 0.8900
2 0.3500 0.9200 0.0000 0.5000 0.2600 0.8800 0.1600 0.9100 0.1600 0.5000
3 1.0000 0.7600 0.3200 0.8100 0.2400 0.5100 1.0000 0.0000 1.0000 0.4400
4 0.0800 0.0000 1.0000 1.0000 0.0900 0.2700 0.0800 0.5600 0.7200 0.1900
5 0.3500 0.2800 0.9800 0.9500 0.2700 1.0000 0.3600 0.4200 0.5900 1.0000
6 0.0000 1.0000 0.6200 0.6600 1.0000 0.6600 0.6300 0.1200 0.9500 0.3700
7 0.6700 0.9800 0.4400 0.6500 0.6100 0.5600 0.0000 0.9400 0.4700 0.0000

### 65. How to compute the correlation of each row with the suceeding row?

##### Input:

Compute the correlation of each row of df with its succeeding row.

##### solution:

In [304]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

[df.iloc[i].corr(df.iloc[i+1]).round(2) for i in range(df.shape[0])[:-1]]

[-0.04, 0.21, -0.25, -0.41, 0.32, 0.29, 0.15]

### 66. How to replace both the diagonals of dataframe with 0?

##### Input:

In [340]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))

##### solution:

In [342]:
a = df.values.copy()
np.fill_diagonal(a, 0)
a = np.fliplr(a)
np.fill_diagonal(a, 0)
np.fliplr(a)

array([[ 0, 85, 52, 28, 41, 67, 50, 45, 23,  0],
       [ 8,  0, 49, 48, 57, 92, 77, 73,  0, 54],
       [ 5, 85,  0, 78, 27, 80, 94,  0, 46, 20],
       [24, 80, 41,  0, 73, 72,  0, 17,  7, 46],
       [93, 53, 38, 12,  0,  0, 10, 28, 15, 49],
       [41, 30, 59, 24,  0,  0, 46, 57, 80, 39],
       [16, 46, 21,  0,  4, 22,  0, 18, 97, 40],
       [70, 71,  0, 30, 42, 41, 88,  0, 26, 86],
       [99,  0, 47, 77, 23, 22, 24, 74,  0, 88],
       [ 0,  2, 94, 17, 17,  4, 42,  1, 75,  0]])

### 67. How to get the particular group of a groupby dataframe by key?

##### Input:

This is a question related to understanding of grouped dataframe. From df_grouped, get the group belonging to 'apple' as a dataframe.

##### solution:

In [351]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])

In [352]:
# solution1 
df.iloc[df_grouped.groups["apple"]]

    col1   col2  col3
0  apple 0.1054    10
3  apple 0.6172     3
6  apple 0.4831     3

In [353]:
# solution 2
df_grouped.get_group('apple')

    col1   col2  col3
0  apple 0.1054    10
3  apple 0.6172     3
6  apple 0.4831     3

### 68. How to get the n’th largest value of a column when grouped by another column?

##### Input:

In df, find the second largest value of 'taste' for 'banana'

##### solution:

In [366]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
n = 2

In [369]:
sec_max = (df
           .groupby('fruit')
           .get_group('banana')
           .sort_values("taste", ascending=False)
           .iloc[n-1])
sec_max

fruit    banana
taste    0.4511
price        10
Name: 4, dtype: object

### 69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?

##### Input:

In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

##### solution:

In [379]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df.groupby('fruit', as_index=False)['price'].mean()

    fruit  price
0   apple 7.3333
1  banana 8.0000
2  orange 6.6667

### 70. How to join two dataframes by 2 columns so they have only the common rows?

##### Input:

Join dataframes df1 and df2 by ‘fruit-pazham’ and ‘weight-kilo’.

##### solution:

In [381]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

merged = (pd
          .merge(df1, df2, 
                 how='inner', 
                 left_on=['fruit', 'weight'], 
                 right_on=['pazham', 'kilo'], 
                 suffixes=['_1', '_2'])
         )
merged

    fruit weight  price_1  pazham  kilo  price_2
0   apple   high        6   apple  high        3
1   apple   high       11   apple  high        3
2   apple   high        9   apple  high        3
3  orange    low        6  orange   low        0
4  orange    low       12  orange   low        0
5  orange    low        2  orange   low        0

### 71. How to remove rows from a dataframe that are present in another dataframe?

##### Input:

From df1, remove the rows that are present in df2. All three columns must be the same.

##### solution:

In [390]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

In [395]:
df1[~df1.isin(df2)]

    fruit  weight   price
0   apple    high  4.0000
1  banana  medium  4.0000
2  orange     low  3.0000
3   apple    high  8.0000
4  banana  medium  3.0000
5  orange     low     nan
6   apple    high 12.0000
7  banana  medium  1.0000
8  orange     low  2.0000

### 72. How to get the positions where values of two columns match?

##### Input:

In [396]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})

##### solution:

In [402]:
df[df["fruit1"] == df["fruit2"]].index.tolist()

[0, 6, 8, 9]

### 73. How to create lags and leads of a column in a dataframe?

##### Input:

Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column ‘a’ and the other is a lead1 (shift column b up by 1 row).

##### solution:

In [409]:
df = (pd
      .DataFrame(np.random.randint(1, 100, 20)
                 .reshape(-1, 4)
                 , columns = list('abcd'))
     )

df["lag1"] = df["a"].shift(1)
df["lead1"] = df["b"].shift(-1)

df

    a   b   c   d    lag1   lead1
0  44   5  11  90     nan 14.0000
1  22  14  41  66 44.0000 52.0000
2   2  52  25  14 22.0000 53.0000
3   9  53  19  77  2.0000 93.0000
4  42  93   3  72  9.0000     nan

### 74. How to get the frequency of unique values in the entire dataframe?

##### Input:

In [410]:
df = (pd
      .DataFrame(np.random.randint(1, 10, 20)
                 .reshape(-1, 4), 
                 columns = list('abcd'))
     )

##### solution:

In [416]:
pd.value_counts(df.values.ravel())

5    7
8    3
9    2
7    2
6    2
4    1
3    1
2    1
1    1
dtype: int64

### 75. How to split a text column into two separate columns?

##### Input:

Split the string column in df to form a dataframe with 3 columns as shown.

##### solution:

In [442]:
df = pd.DataFrame(["STD, City   State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

In [451]:
sep_df = df.row.str.split(r"\,|    ", expand=True)
sep_df.columns = sep_df.iloc[0]
sep_df = sep_df.drop(0).reset_index(drop=True)
sep_df

0 STD        City        State
0  33     Kolkata  West Bengal
1  44     Chennai   Tamil Nadu
2  40   Hyderabad    Telengana
3  80   Bangalore    Karnataka